const arrayOfLoveWishes = [
  "Нехай кожен день приносить радість і тепло!",  
  "Нехай кохання буде вічним",
  "Нехай любов завжди зігріває твоє серце, а щастя ніколи не покидає душу!",
"💘 Бажаю взаємної, щирої та безмежної любові, яка надихає та робить кожен день особливим!",
"🌹 Нехай у твоєму житті завжди буде людина, яка кохає тебе так, як ти того заслуговуєш!",
"💞 Нехай цей день буде сповнений романтики, ніжності та найтепліших емоцій!",
"🥰 Бажаю, щоб любов була твоєю постійною супутницею, дарувала радість і гармонію!",
"💑 Нехай у твоєму житті буде багато приємних сюрпризів, щирих поцілунків та палких обіймів!",
"💕 Любові, яка надихає, підтримує та наповнює життя щастям і змістом!",
"🎀 Нехай кожен день буде сповнений щирих почуттів, посмішок і теплих слів від найдорожчих людей!",
]

document.getElementById('btn_love_wishes').addEventListener(`click`, () =>{
    let index = Math.floor(Math.random() * arrayOfLoveWishes.length)
    document.getElementById('p-love-wishes').innerText = arrayOfLoveWishes[index]
})